OpenFOAM/Spalart-Allmaras/Coarse-Mesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-4 0 -2)
    ( 4 0 -2)
    ( 4 2 -2)
    (-4 2 -2)
    (-4 0  2)
    ( 4 0  2)
    ( 4 2  2)
    (-4 2  2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (40 10 20)
    simpleGrading (1 1 1)
);

boundary
(
    left
    {
        type patch;
        faces ((0 4 7 3));
    }

    right
    {
        type patch;
        faces ((1 2 6 5));
    }

    top
    {
        type patch;
        faces ((4 5 6 7));
    }

    bottom
    {
        type patch;
        faces ((0 3 2 1));
    }

    symmetry
    {
        type symmetryPlane;
        faces ((1 5 4 0));
    }

    back
    {
        type patch;
        faces ((3 7 6 2));
    }
);


// ************************************************************************* //
