OpenFOAM/Spalart-Allmaras/Coarse-Mesh/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.40e-05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0374;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall_int
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall_ext
    {
        type            fixedValue;
        value           uniform 0;
    }

    freestream
    {
        type            zeroGradient;
    }

    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
